       *Call = ReadCall;
            *InOutData = Data;
            return Call->Status;
        }

        PUCHAR OutData;
        if (ReadCall.OutSize > 0)
        {
            DBG_ASSERT((ReadCall.Flags & DBGRPC_NO_RETURN) == 0);

            OutData = (PUCHAR)Conn->Alloc(ReadCall.OutSize);
            if (OutData == NULL)
            {
                if (Data)
                {
                    Conn->Free(Data);
                }
                return E_OUTOFMEMORY;
            }
        }
        else
        {
            OutData = NULL;
        }

        if (ReadCall.Flags & DBGRPC_NO_RETURN)
        {
            Conn->m_Flags |= DBGRPC_IN_ASYNC_CALL;
        }

        DbgRpcStubFunction StubFn = DbgRpcGetStub(ReadCall.StubIndex);
        if (StubFn != NULL)
        {
            ReadCall.Status = StubFn((IUnknown*)ReadCall.ObjectId,
                                     Conn, &ReadCall, Data, OutData);
        }
        else
        {
            ReadCall.Status = RPC_E_INVALIDMETHOD;
        }

        Conn->m_Flags &= ~DBGRPC_IN_ASYNC_CALL;

        DRPC(("%X: %X: Called %s (%X), ret 0x%X, out %d\n",
              GetCurrentThreadId(), ReadCall.Sequence,
              DbgRpcGetStubName(ReadCall.StubIndex),
              ReadCall.StubIndex, ReadCall.Status, ReadCall.OutSize));

        Status = S_OK;
        if ((ReadCall.Flags & DBGRPC_NO_RETURN) == 0)
        {
            ReadCall.Flags |= DBGRPC_RETURN;


    CrashInfo->FailureType = DEBUG_FLR_BUGCHECK;
    CrashInfo->BugCode = Bc->Code;

    // Initialize known parameters
    CrashInfo->ParamCount = ParamCount;

    CrashInfo->Params[0].ParamType = DEBUG_FLR_SPECIAL_POOL_CORRUPTION_TYPE;
    CrashInfo->Params[0].Value     = Bc->Args[3];
    if (ParamCount == 3) {
        CrashInfo->Params[1].ParamType = DEBUG_FLR_POSSIBLE_FAULTING_MODULE;
        CrashInfo->Params[1].Value     = ModBase;
        CrashInfo->Params[2].ParamType = DEBUG_FLR_POSSIBLE_FAULTING_MODULE_OFFSET;
        CrashInfo->Params[2].Value     = Offset;
    }

    *pCrashInfo = CrashInfo;
    return;
}


void GetInfoForDRIVER_CAUGHT_MODIFYING_FREED_POOL( // (c6)
    PBUGCHECK_ANALYSIS Bc,
    PDEBUG_FAILURE_ANALYSIS *pCrashInfo
    )
/*
  An attempt was made to access freed pool memory.  The faulty component is
  displayed in the current kernel stack.
  Arguments:
   Arg1: memory referenced
   Arg2: value 0 = read operation, 1 = write operation
   Arg3: previous mode.
   Arg4: 4.
*/
{
    DEBUG_POOL_DATA PoolData;
    ULONG ParamCount = 3;
    PDEBUG_FAILURE_ANALYSIS CrashInfo;
    
    CrashInfo = FAInitMemBlock(sizeof(DEBUG_FAILURE_ANALYSIS) + ParamCount*sizeof(DEBUG_FLR_PARAM_VALUES));
    if (!CrashInfo) {
        *pCrashInfo = NULL;
        return;
    }

    CrashInfo->FailureType = DEBUG_FLR_BUGCHECK;
    CrashInfo->BugCode = Bc->Code;

    // Initialize known parameters
    CrashInfo->ParamCount = ParamCount;
    CrashInfo->Params[0].ParamType = Bc->Args[1] ? DEBUG_FLR_WRITE_ADDRESS : DEBUG_FLR_READ_ADDRESS;
    CrashInfo->Params[0].Value     = Bc->Args[0];
    CrashInfo->Params[1].ParamType = DEBUG_FLR_PREVIOUS_MODE;
    CrashInfo->Params[1].Value     = Bc->Args[2];
    CrashInfo->Params[2].ParamType = DEBUG_FLR_POOL_ADDRESS;
    CrashInfo->Params[2].Value     = Bc->Args[0];  // This is address in the pool, 
                                                   // _EFN_GetPoolData will give more info
    *pCrashInfo = CrashInfo;
    return;
}



void GetInfoForTIMER_OR_DPC_INVALID( // (c7)
    PBUGCHECK_ANALYSIS Bc,
    PDEBUG_FAILURE_ANALYSIS *pCrashInfo
    )
/*
 *
 * This is issued if a kernel timer or DPC is found somewhere in
 * memory where it is not permitted.
 *
 * Bugcheck Parameters
 *
 * Parameter 1  0: Timer object 1: DPC object 2: DPC routine
 * Parameter 2  Address of object
 * Parameter 3  Beginning of memory range checked
 * Parameter 4 End of memory range checked
 *
 * This condition is usually caused by a driver failing to cancel a
 * timer or DPC before freeing the memory where it resides.
 *
 * This returns the address of DPC routine
 */
{

    ULONG ParamCount = 0;
    PDEBUG_FAILURE_ANALYSIS CrashInfo;
    ULONG PtrSize = IsPtr64() ? 8 : 4;
    ULONG64 ObjAddress;
    ULONG64 ModBase, ModOffset;
    CHAR  Buffer[MAX_PATH];

    ObjAddress = Bc->Args[1];
    switch (Bc->Args[0]) {
    case 0: //Timer object
        ULONG DpcOffsetInTimer;
        /* 
        KTIMER struct:
           +0x000 Header           :
              +0x000 Type             : UChar
              +0x001 Absolute         : UChar
              +0x002 Size             : UChar
              +0x003 Inserted         : UChar
              +0x004 SignalState      : Int4B
              +0x008 WaitListHead     :
                 +0x000 Flink            : Ptr
                 +0x004 Blink            : Ptr
           +0x010 DueTime          :
              +0x000 LowPart          : Uint4B
              +0x004 HighPart         : Uint4B
              +0x000 u                :
                 +0x000 LowPart          : Uint4B
                 +0x004 HighPart         : Uint4B
              +0x000 QuadPart         : Uint8B
           +0x018 TimerListEntry   :
              +0x000 Flink            : Ptr
              +0x004 Blink            : Ptr
           +0x020 Dpc              : Ptr
           */
        if (GetFieldOffset("nt!_KTIMER", "Dpc", &DpcOffsetInTimer)) {
            // we don't have types
            DpcOffsetInTimer = 0x10 + PtrSize*4; 
        }
        if (!ReadPointer(ObjAddress + DpcOffsetInTimer, &ObjAddress)) {
            // fail
            break;
        }
        // Fall thru
    case 1:
        ULONG DeferredRoutinOffsetInKDPC;
        /*
        KDPC struct
           +0x000 Type             : Int2B
           +0x002 Number           : UChar
           +0x003 Importance       : UChar
           +0x004 DpcListEntry     : _LIST_ENTRY
           +0x00c DeferredRoutine  : Ptr32
        */
        if (GetFieldOffset("nt!_KDPC", "DeferredRoutine", &DeferredRoutinOffsetInKDPC)) {
            DeferredRoutinOffsetInKDPC = 4 + PtrSize*2;
        }
        if (!ReadPointer(ObjAddress + DeferredRoutinOffsetInKDPC, &ObjAddress)) {
            // fail
            break;
        }
        // Fall thru
    case 2:
        GetModuleBaseAndOffset(ObjAddress, &ModBase, &ModOffset);
        if (ModBase) {
            ParamCount = 3;
        }
    }

    ULONG64 Disp;
    ULONG NameLen;
    ULONG ParamSize;

    ParamSize = ParamCount*sizeof(DEBUG_FLR_PARAM_VALUES);
    GetSymbol(ObjAddress, Buffer, &Disp);
    NameLen = strlen(Buffer) + 1;
    NameLen = DWORD_ALIGN(NameLen);

    CrashInfo = FAInitMemBlock(sizeof(DEBUG_FAILURE_ANALYSIS) + ParamSize + NameLen);
    if (!CrashInfo) {
        *pCrashInfo = NULL;
        return;
    }

    CrashInfo->FailureType = DEBUG_FLR_BUGCHECK;
    CrashInfo->BugCode = Bc->Code;

